 
<pad>
!
"
'
,
-
.
0
1
2
3
4
5
6
7
8
9
:
;
?
A
B
C
D
E
F
G
H
I
J
K
L
M
N
O
P
Q
R
S
T
U
V
W
X
Y
Z
^
`
a
aa
ai
an
ang
ao
au
aɜ
aɪ
aɪə
aɪɚ
aʊ
aʊɜ
b
ba
bai
ban
bang
bao
bei
ben
beng
bi
bian
biao
bie
bin
bing
bo
bu
by
c
ca
cai
can
cang
cao
ce
cen
ceng
ch
cha
chai
chan
chang
chao
che
chen
cheng
chi
chong
chou
chu
chua
chuai
chuan
chuang
chui
chun
chuo
ci
cl
cong
cou
cu
cuan
cui
cun
cuo
d
da
dai
dan
dang
dao
de
dei
den
deng
di
dia
dian
diao
die
ding
diu
dong
dou
du
duan
dui
dun
duo
dy
dz
dʑ
dʒ
e
ea
ed
ee
eh
ei
ekh
en
eo
ep
eph
eq
er
es
et
etɕ
etʃ
eu
ey
eɑ
eə
eɜ
eɡ
eɪ
eɾ
eʊ
f
fa
fan
fang
fei
fen
feng
fo
fou
fu
g
ga
gai
gan
gang
gao
ge
gei
gen
geng
gong
gou
gu
gua
guai
guan
guang
gui
gun
guo
gy
h
ha
hai
han
hang
hao
he
hei
hen
heng
hong
hou
hu
hua
huai
huan
huang
hui
hun
huo
hy
i
id
ie
ih
ikh
ip
iph
iq
is
it
itɕ
itʃ
iu
iy
iə
iəɜ
iɛ
iɛɜ
iɜ
iɡ
iɪ
iɾ
iʊ
j
ja
jd
jh
ji
jia
jian
jiang
jiao
jie
jin
jing
jiong
jiu
jkh
jp
jph
jq
js
jt
jtɕ
jtʃ
ju
juan
jue
jun
jɡ
jɾ
k
ka
kai
kan
kang
kao
ke
ken
keng
kh
kong
kou
ku
kua
kuai
kuan
kuang
kui
kun
kuo
ky
l
la
lai
lan
lang
lao
le
lei
leng
li
lia
lian
liang
liao
lie
lin
ling
liu
long
lou
lu
luan
lun
luo
lv
lve
m
ma
mai
man
mang
mao
md
me
mei
men
meng
mh
mi
mian
miao
mie
min
ming
miu
mkh
mo
mou
mp
mph
mq
ms
mt
mtɕ
mtʃ
mu
my
mɡ
n
na
nai
nan
nang
nao
nd
ne
nei
nen
neng
nh
ni
nian
niang
niao
nie
nin
ning
niu
nkh
nong
nou
np
nph
nq
ns
nt
ntɕ
ntʃ
nu
nuan
nuo
nv
nve
ny
o
od
oh
oi
okh
op
oph
oq
os
ot
otɕ
otʃ
ou
oɜ
oɡ
oɪ
oɾ
oʊ
p
pa
pai
pan
pang
pao
pau
pei
pen
peng
pf
ph
pi
pian
piao
pie
pin
ping
po
pou
pp
pq
ps
pt
ptɕ
ptʃ
pu
py
q
qi
qia
qian
qiang
qiao
qie
qin
qing
qiong
qiu
qkh
qp
qph
qq
qs
qt
qtɕ
qtʃ
qu
quan
que
qun
r
ran
rang
rao
re
ren
reng
ri
rong
rou
ru
ruan
rui
run
ruo
ry
s
sa
sai
san
sang
sao
se
sen
seng
sh
sha
shai
shan
shang
shao
she
shei
shen
sheng
shi
shou
shu
shua
shuai
shuan
shuang
shui
shun
shuo
si
song
sou
ss
su
suan
sui
sun
suo
sx
t
ta
tai
tan
tang
tao
te
teng
ti
tian
tiao
tie
ting
tong
tou
ts
tu
tuan
tui
tun
tuo
ty
tɕ
tʃ
u
ud
uh
ui
ukh
uo
up
uph
uq
us
ut
utɕ
utʃ
uə
uəɜ
uɜ
uɡ
uɪ
uɾ
v
w
wa
wai
wan
wang
wei
wen
weng
wo
wu
x
xi
xia
xian
xiang
xiao
xie
xin
xing
xiong
xiu
xu
xuan
xue
xun
y
ya
yan
yang
yao
ye
yi
yin
ying
yo
yong
you
yu
yuan
yue
yun
yø
yə
yəɜ
yɜ
yɪ
yʊ
z
za
zai
zan
zang
zao
ze
zei
zen
zeng
zha
zhai
zhan
zhang
zhao
zhe
zhen
zheng
zhi
zhong
zhou
zhu
zhua
zhuai
zhuan
zhuang
zhui
zhun
zhuo
zi
zong
zou
zu
zuan
zui
zun
zuo
·
æ
æi
æy
ææ
ç
ð
ø
øi
øy
ŋ
ŋd
ŋh
ŋi
ŋkh
ŋp
ŋph
ŋq
ŋs
ŋt
ŋtɕ
ŋtʃ
ŋɡ
œ
œy
ɐ
ɐd
ɐh
ɐi
ɐkh
ɐp
ɐph
ɐq
ɐs
ɐt
ɐtɕ
ɐtʃ
ɐɐ
ɐɡ
ɐɾ
ɑ
ɑɑ
ɒ
ɒɒ
ɔ
ɔa
ɔø
ɔɔ
ɔɜ
ɔɪ
ɕ
ɗ
ə
əl
əɜ
əɪ
əɪɜ
əʊ
əʊɜ
ɚ
ɛ
ɛd
ɛh
ɛi
ɛkh
ɛp
ɛph
ɛq
ɛs
ɛt
ɛtɕ
ɛtʃ
ɛɜ
ɛɡ
ɛɪ
ɛɹ
ɛɾ
ɛʊ
ɜ
ɟ
ɡ
ɣ
ɤ
ɨ
ɪ
ɪɹ
ɫ
ɫd
ɫh
ɫkh
ɫp
ɫph
ɫq
ɫs
ɫt
ɫtɕ
ɫtʃ
ɫɡ
ɫɾ
ɬ
ɭ
ɯ
ɯd
ɯh
ɯi
ɯkh
ɯp
ɯph
ɯq
ɯs
ɯt
ɯtɕ
ɯtʃ
ɯɡ
ɯɾ
ɲ
ɵ
ɹ
ɹɹ
ɾ
ʁ
ʂ
ʃ
ʉ
ʊ
ʊɐ
ʊə
ʊɹ
ʋ
ʌ
ʌd
ʌh
ʌi
ʌkh
ʌp
ʌph
ʌq
ʌs
ʌt
ʌtɕ
ʌtʃ
ʌɡ
ʌɾ
ʌʊ
ʍ
ʎ
ʏ
ʐ
ʑ
ʒ
ʔ
ʔe
ʔi
ʔo
ʔu
ʔy
ʔœ
ʔʌ
ʝ
ʰ
ʲ
ˈ
ˌ
ː
̃
̊
̝
̩
̪
̯
͡
β
ε
θ
χ
ᵻ
—
…
